{"package_name": "foundation", "interface_list": ["OptionSet"], "class_inherit_list": [], "Methods": [], "Vars": [{"var_type": "DateComponentsFormatter.ZeroFormattingBehavior", "var_description": "The default formatting behavior. When using positional units, this behavior drops leading zeroes but pads middle and trailing values with zeros as needed. For example, with hours, minutes, and seconds displayed, the value for one hour and 10 seconds is “1:00:10”. For all other unit styles, this behavior drops all units whose values are 0. For example, when days, hours, minutes, and seconds are allowed, the abbreviated version of one hour and 10 seconds is displayed as “1h 10s”.  ", "var_name": "`default`"}, {"var_type": "DateComponentsFormatter.ZeroFormattingBehavior", "var_description": "The drop leading zeroes formatting behavior. Units whose values are 0 are dropped starting at the beginning of the sequence. Units continue to be dropped until a non-zero value is encountered. For example, when days, hours, minutes, and seconds are allowed, the abbreviated version of ten minutes is displayed as “10m 0s”. ", "var_name": "dropLeading"}, {"var_type": "DateComponentsFormatter.ZeroFormattingBehavior", "var_description": "The drop middle zero units behavior. Units whose values are 0 are dropped from anywhere in the middle of a sequence. For example, when days, hours, minutes, and seconds are allowed, the abbreviated version of one hour, zero minutes, and five seconds is displayed as “0d 1h 5s”.  ", "var_name": "dropMiddle"}, {"var_type": "DateComponentsFormatter.ZeroFormattingBehavior", "var_description": "The drop trailing zero units behavior. Units whose value is 0 are dropped starting at the end of the sequence. For example, when days, hours, minutes, and seconds are allowed, the abbreviated version of one hour is displayed as “0d 1h”. ", "var_name": "dropTrailing"}, {"var_type": "DateComponentsFormatter.ZeroFormattingBehavior", "var_description": "The drop all zero units behavior. This behavior drops all units whose values are 0. For example, when days, hours, minutes, and seconds are allowed, the abbreviated version of one hour is displayed as “1h”. ", "var_name": "dropAll"}, {"var_type": "DateComponentsFormatter.ZeroFormattingBehavior", "var_description": "The add padding zeroes behavior. This behavior pads values with zeroes as appropriate. For example, consider the value of one hour formatted using the positional and abbreviated unit styles. When days, hours, minutes, and seconds are allowed, the value is displayed as “0d 1:00:00” using the positional style, and as “0d 1h 0m 0s” using the abbreviated style. ", "var_name": "pad"}], "subclass_list": [], "class_description": "", "class_name": "DateComponentsFormatter.ZeroFormattingBehavior"}