{"package_name": "foundation", "interface_list": ["OptionSet"], "class_inherit_list": [], "Methods": [], "Vars": [{"var_type": "NSCalendar.Options", "var_description": "Specifies that the components specified for an NSDateComponents object should be incremented and wrap around to zero/one on overflow, but should not cause higher units to be incremented.", "var_name": "wrapComponents"}, {"var_type": "NSCalendar.Options", "var_description": "Specifies that the operation should travel as far forward or backward as necessary looking for a match.", "var_name": "matchStrictly"}, {"var_type": "NSCalendar.Options", "var_description": "Specifies that the operation should travel backwards to find the previous match before the given date.", "var_name": "searchBackwards"}, {"var_type": "NSCalendar.Options", "var_description": "Specifies that, when there is no matching time before the end of the next instance of the next highest unit specified in the given NSDateComponents object, this method uses the previous existing value of the missing unit and preserves the lower units' values.", "var_name": "matchPreviousTimePreservingSmallerUnits"}, {"var_type": "NSCalendar.Options", "var_description": "Specifies that, when there is no matching time before the end of the next instance of the next highest unit specified in the given NSDateComponents object, this method uses the next existing value of the missing unit and preserves the lower units' values.", "var_name": "matchNextTimePreservingSmallerUnits"}, {"var_type": "NSCalendar.Options", "var_description": "Specifies that, when there is no matching time before the end of the next instance of the next highest unit specified in the given NSDateComponents object, this method uses the next existing value of the missing unit and does not preserve the lower units' values.", "var_name": "matchNextTime"}, {"var_type": "NSCalendar.Options", "var_description": "Specifies that, if there are two or more matching times, the operation should return the first occurrence.", "var_name": "matchFirst"}, {"var_type": "NSCalendar.Options", "var_description": "Specifies that, if there are two or more matching times, the operation should return the last occurrence.", "var_name": "matchLast"}, {"var_type": "Int", "var_description": "Specifies that the components specified for an NSDateComponents object should be incremented and wrap around to zero/one on overflow, but should not cause higher units to be incremented.DeprecatedUse wrapComponents instead.", "var_name": "NSWrapCalendarComponents"}], "subclass_list": [], "class_description": "", "class_name": "NSCalendar.Options"}