{"package_name": "foundation", "interface_list": ["CVarArg", "Equatable", "Hashable"], "class_inherit_list": ["NSObject"], "Methods": [{"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "invalidateClassDescriptionCache", "class_name": "NSClassDescription", "method_description": "Removes all NSClassDescription objects from the cache.", "params": []}, {"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "register", "class_name": "NSClassDescription", "method_description": "Registers an NSClassDescription object for a given class in the NSClassDescription cache.", "params": [{"param_type": "NSClassDescription", "param_name": ["description"], "param_description": ""}, {"param_type": "AnyClass", "param_name": ["for", "aClass"], "param_description": ""}]}, {"return_value": {"return_type": ["String"], "return_name": [""], "return_description": ["The name of the inverse relationship from the relationship specified by relationshipKey."]}, "method_name": "inverse", "class_name": "NSClassDescription", "method_description": "Overridden by subclasses to return the name of the inverse relationship from a relationship specified by a given key. ", "params": [{"param_type": "String", "param_name": ["forRelationshipKey", "relationshipKey"], "param_description": ""}]}], "Vars": [{"var_type": "[String]", "var_description": "Overridden by subclasses to return the names of attributes of instances of the described class.", "var_name": "attributeKeys"}, {"var_type": "[String]", "var_description": "Overridden by subclasses to return the keys for the to-many relationship properties of instances of the described class.", "var_name": "toManyRelationshipKeys"}, {"var_type": "[String]", "var_description": "Overridden by subclasses to return the keys for the to-one relationship properties of instances of the described class.", "var_name": "toOneRelationshipKeys"}, {"var_type": "NSNotification.Name", "var_description": "Posted by init(for:) when a class description cannot be found for a class.", "var_name": "NSClassDescriptionNeededForClass"}], "subclass_list": [], "class_description": "Concrete subclasses of NSClassDescription provide the available attributes of objects of a particular class and the relationships between that class and other classes. Defining these relationships between classes allows for more intelligent and flexible manipulation of objects with key-value coding.\nIt is important to note that there are no class descriptions by default. To use NSClassDescription objects in your code you have to implement them for your model classes. For all concrete subclasses, you must provide implementations for all instance methods of NSClassDescription. (NSClassDescription provides only the implementation for the class methods that maintain the cache of registered class descriptions.) Once created, you must register a class description with the NSClassDescription method register(_:for:).\nYou can use the NSString objects in the arrays returned by methods such as attributeKeys and toManyRelationshipKeys  to access—using key-value coding—the properties of an instance of the class to which a class description object corresponds. For more about attributes and relationships, see Cocoa Fundamentals Guide. For more about key-value coding, see Key-Value Coding Programming Guide.\nNSScriptClassDescription, which is used to map the relationships between scriptable classes, is the only concrete subclass of NSClassDescription provided as part of the Cocoa framework.\n", "class_name": "NSClassDescription"}