{"package_name": "foundation", "interface_list": ["CVarArg", "Equatable", "Hashable", "NSLocking"], "class_inherit_list": ["NSObject"], "Methods": [{"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "wait", "class_name": "NSCondition", "method_description": "Blocks the current thread until the condition is signaled.", "params": []}, {"return_value": {"return_type": ["Bool"], "return_name": [""], "return_description": ["true if the condition was signaled; otherwise, false if the time limit was reached. "]}, "method_name": "wait", "class_name": "NSCondition", "method_description": "Blocks the current thread until the condition is signaled or the specified time limit is reached.", "params": [{"param_type": "Date", "param_name": ["until", "limit"], "param_description": ""}]}, {"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "signal", "class_name": "NSCondition", "method_description": "Signals the condition, waking up one thread waiting on it.", "params": []}, {"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "broadcast", "class_name": "NSCondition", "method_description": "Signals the condition, waking up all threads waiting on it.", "params": []}], "Vars": [{"var_type": "String", "var_description": "The name of the condition.", "var_name": "name"}], "subclass_list": [], "class_description": "A condition object acts as both a lock and a checkpoint in a given thread. The lock protects your code while it tests the condition and performs the task triggered by the condition. The checkpoint behavior requires that the condition be true before the thread proceeds with its task. While the condition is not true, the thread blocks. It remains blocked until another thread signals the condition object. \nThe semantics for using an NSCondition object are as follows:\nLock the condition object.\nTest a boolean predicate. (This predicate is a boolean flag or other variable in your code that indicates whether it is safe to perform the task protected by the condition.)\nIf the boolean predicate is false, call the condition object’s wait() or wait(until:) method to block the thread. Upon returning from these methods, go to step 2 to retest your boolean predicate. (Continue waiting and retesting the predicate until it is true.) \nIf the boolean predicate is true, perform the task.\nOptionally update any predicates (or signal any conditions) affected by your task. \nWhen your task is done, unlock the condition object.\nThe pseudocode for performing the preceding steps would therefore look something like the following:\nWhenever you use a condition object, the first step is to lock the condition. Locking the condition ensures that your predicate and task code are protected from interference by other threads using the same condition. Once you have completed your task, you can set other predicates or signal other conditions based on the needs of your code. You should always set predicates and signal conditions while holding the condition object’s lock.  \nWhen a thread waits on a condition, the condition object unlocks its lock and blocks the thread. When the condition is signaled, the system wakes up the thread. The condition object then reacquires its lock before returning from the wait() or wait(until:) method. Thus, from the point of view of the thread, it is as if it always held the lock.\nA boolean predicate is an important part of the semantics of using conditions because of the way signaling works. Signaling a condition does not guarantee that the condition itself is true. There are timing issues involved in signaling that may cause false signals to appear. Using a predicate ensures that these spurious signals do not cause you to perform work before it is safe to do so. The predicate itself is simply a flag or other variable in your code that you test in order to acquire a Boolean result. \n For more information on how to use conditions, see Using POSIX Thread Locks in Threading Programming Guide.\n", "class_name": "NSCondition"}