{"package_name": "foundation", "interface_list": ["CVarArg", "Equatable", "Hashable"], "class_inherit_list": ["NSObject"], "Methods": [{"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "setInsertionClassDescription", "class_name": "NSPositionalSpecifier", "method_description": "Sets the class description for the object or objects to be inserted.", "params": [{"param_type": "NSScriptClassDescription", "param_name": ["classDescription"], "param_description": ""}]}, {"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "evaluate", "class_name": "NSPositionalSpecifier", "method_description": "Causes the receiver to evaluate its position.", "params": []}], "Vars": [{"var_type": "Any", "var_description": "Returns the container in which the new or copied object or objects should be placed.", "var_name": "insertionContainer"}, {"var_type": "Int", "var_description": "Returns an insertion index that indicates where the new or copied object or objects should be placed.", "var_name": "insertionIndex"}, {"var_type": "String", "var_description": "Returns the key that identifies the relationship into which the new or copied object or objects should be inserted.", "var_name": "insertionKey"}, {"var_type": "Bool", "var_description": "Returns a Boolean value that indicates whether evaluation has been successful and the object to be inserted should actually replace the keyed, indexed object in the insertion container.", "var_name": "insertionReplaces"}, {"var_type": "NSScriptObjectSpecifier", "var_description": "Returns the object specifier specified at initialization time.", "var_name": "objectSpecifier"}, {"var_type": "NSPositionalSpecifier.InsertionPosition", "var_description": "Returns the insertion position specified at initialization time.", "var_name": "position"}], "subclass_list": [], "class_description": "Instances of NSPositionalSpecifier specify an insertion point in a container relative to another object in the container, for example, before first word or after paragraph 4. The container is specified by an instance of NSScriptObjectSpecifier. NSPositionalSpecifier objects commonly encapsulate object specifiers used as arguments to the make (create) and move commands and indicate where the created or moved object is to be inserted relative to the object represented by an object specifier.\nInvoking an accessor method to obtain information about an instance of NSPositionalSpecifier  causes the object to be evaluated if it hasn’t been already.\nYou don’t normally subclass NSPositionalSpecifier.\n", "class_name": "NSPositionalSpecifier"}