{"package_name": "foundation", "interface_list": ["CVarArg", "Equatable", "Hashable", "NSCoding"], "class_inherit_list": ["NSObject"], "Methods": [{"return_value": {"return_type": ["UnsafeMutablePointer<Int>"], "return_name": [""], "return_description": []}, "method_name": "indicesOfObjectsByEvaluating", "class_name": "NSScriptObjectSpecifier", "method_description": "This primitive method must be overridden by subclasses to return a pointer to an array of indices identifying objects in the key of a given container that are identified by the receiver of the message. ", "params": [{"param_type": "Any", "param_name": ["withContainer", "container"], "param_description": ""}, {"param_type": "UnsafeMutablePointer<Int>", "param_name": ["count"], "param_description": ""}]}, {"return_value": {"return_type": ["Any"], "return_name": [""], "return_description": ["The actual object or objects specified by the receiver as evaluated in the context of its container object or objects (containers)."]}, "method_name": "objectsByEvaluating", "class_name": "NSScriptObjectSpecifier", "method_description": "Returns the actual object or objects specified by the receiver as evaluated in the context of given container object. ", "params": [{"param_type": "Any", "param_name": ["withContainers", "containers"], "param_description": ""}]}], "Vars": [{"var_type": "Any", "var_description": "Returns the actual object represented by the nested series of object specifiers.", "var_name": "objectsByEvaluatingSpecifier"}, {"var_type": "NSScriptClassDescription", "var_description": "Sets the class description of the receiver’s container specifier to a given specifier.", "var_name": "containerClassDescription"}, {"var_type": "Bool", "var_description": "Sets whether the receiver’s container should be an object involved in a filter reference or the top-level object.", "var_name": "containerIsObjectBeingTested"}, {"var_type": "Bool", "var_description": "Sets whether the receiver’s container is to be the container for a range specifier or a top-level object.", "var_name": "containerIsRangeContainerObject"}, {"var_type": "NSScriptObjectSpecifier", "var_description": "Sets the container specifier of the receiver.", "var_name": "container"}, {"var_type": "NSScriptObjectSpecifier", "var_description": "Sets the receiver’s child reference.", "var_name": "child"}, {"var_type": "String", "var_description": "Sets the key of the receiver.", "var_name": "key"}, {"var_type": "NSScriptClassDescription", "var_description": "Returns the class description of the objects specified by the receiver.", "var_name": "keyClassDescription"}, {"var_type": "NSScriptObjectSpecifier", "var_description": "Returns the object specifier in which an evaluation error occurred.", "var_name": "evaluationError"}, {"var_type": "Int", "var_description": "Sets the value of the evaluation error.", "var_name": "evaluationErrorNumber"}, {"var_type": "NSAppleEventDescriptor", "var_description": "Returns an Apple event descriptor that represents the receiver.", "var_name": "descriptor"}, {"var_type": "Int", "var_description": "No error encountered.", "var_name": "NSNoSpecifierError"}, {"var_type": "Int", "var_description": "Someone called evaluate with nil.", "var_name": "NSNoTopLevelContainersSpecifierError"}, {"var_type": "Int", "var_description": "Error evaluating container specifier.", "var_name": "NSContainerSpecifierError"}, {"var_type": "Int", "var_description": "Receivers do not understand the key.", "var_name": "NSUnknownKeySpecifierError"}, {"var_type": "Int", "var_description": "Index out of bounds.", "var_name": "NSInvalidIndexSpecifierError"}, {"var_type": "Int", "var_description": "Other internal error.", "var_name": "NSInternalSpecifierError"}, {"var_type": "Int", "var_description": "Attempt made to perform an unsupported operation on some key.", "var_name": "NSOperationNotSupportedForKeySpecifierError"}], "subclass_list": [], "class_description": "NSScriptObjectSpecifier is the abstract superclass for classes that instantiate objects called “object specifiers.” An object specifier represents an AppleScript reference form, which is a natural-language expression such as words 10 through 20 or front document or words whose color is red.\nThe scripting system maps these words or phrases to attributes and relationships of scriptable objects. A reference form rarely occurs in isolation; usually a script statement consists of a series of reference forms preceded by a command and typically connected to each other by of, such as:\nThe expression words whose color is blue of paragraph 10 of front document specifies a location in the application's AppleScript object model—the objects the application makes available to scripters. The classes of objects in the object model often closely match the classes of actual objects in the application, but they are not required to. An object specifier locates objects in the running application that correspond to the specified object model objects.\nYour application typically creates object specifiers when it implements the objectSpecifier method for its scriptable classes. That method is defined by the NSScriptObjectSpecifiers protocol.\nIt is unlikely that you would ever need to create your own subclass of NSScriptObjectSpecifier; the set of valid AppleScript reference forms is determined by Apple Computer and object specifier classes are already implemented for this set. If for some reason you do need to create a subclass, you must override the primitive method indicesOfObjectsByEvaluating(withContainer:count:) to return indices to the elements within the container whose values are matched with the child specifier’s key. In addition, you probably need to declare any special instance variables and implement an initializer that invokes super’s designated initializer, init(containerClassDescription:containerSpecifier:key:), and initializes these variables.\nFor a comprehensive treatment of object specifiers, including sample code, see Object Specifiers in Cocoa Scripting Guide.\n", "class_name": "NSScriptObjectSpecifier"}