{"package_name": "foundation", "interface_list": ["CVarArg", "Equatable", "Hashable"], "class_inherit_list": ["NSClassDescription"], "Methods": [{"return_value": {"return_type": ["NSScriptClassDescription"], "return_name": [""], "return_description": ["The instance of NSScriptClassDescription for the type of the attribute or relationship specified by key. Returns nil if no scriptable property corresponds to key."]}, "method_name": "forKey", "class_name": "NSScriptClassDescription", "method_description": "Returns the class description instance for the class type of the specified attribute or relationship.", "params": [{"param_type": "String", "param_name": ["key"], "param_description": ""}]}, {"return_value": {"return_type": ["Bool"], "return_name": [""], "return_description": ["true if an insertion location must be specified; otherwise, false."]}, "method_name": "isLocationRequiredToCreate", "class_name": "NSScriptClassDescription", "method_description": "Returns a Boolean value indicating whether an insertion location must be specified when creating a new object in the specified to-many relationship of the receiver.", "params": [{"param_type": "String", "param_name": ["forKey", "toManyRelationshipKey"], "param_description": ""}]}, {"return_value": {"return_type": ["FourCharCode"], "return_name": [""], "return_description": ["The four-character Apple event code associated with the attribute or relationship identified by key in the receiver or, if none exists, in the class description for the receiver’s superclass. Returns 0 if no such attribute or relationship is found."]}, "method_name": "appleEventCode", "class_name": "NSScriptClassDescription", "method_description": "Returns the Apple event code for the specified attribute or relationship in the receiver.", "params": [{"param_type": "String", "param_name": ["forKey", "key"], "param_description": ""}]}, {"return_value": {"return_type": ["Bool"], "return_name": [""], "return_description": ["true if the receiver’s primary four-character Apple event code or any of its secondary codes (its synonyms) matches code; otherwise, false."]}, "method_name": "matchesAppleEventCode", "class_name": "NSScriptClassDescription", "method_description": "Returns a Boolean value indicating whether a primary or secondary Apple event code in the receiver matches the passed code.", "params": [{"param_type": "FourCharCode", "param_name": ["appleEventCode"], "param_description": ""}]}, {"return_value": {"return_type": ["Bool"], "return_name": [""], "return_description": ["true if the described class has an ordered to-many relationship identified by the specified key; otherwise, false."]}, "method_name": "hasOrderedToManyRelationship", "class_name": "NSScriptClassDescription", "method_description": "Returns a Boolean value indicating whether the described class has an ordered to-many relationship identified by the specified key.", "params": [{"param_type": "String", "param_name": ["forKey", "key"], "param_description": ""}]}, {"return_value": {"return_type": ["Bool"], "return_name": [""], "return_description": ["true if the described class has a property identified by the specified key; otherwise, false."]}, "method_name": "hasProperty", "class_name": "NSScriptClassDescription", "method_description": "Returns a Boolean value indicating whether the described class has a property identified by the specified key.", "params": [{"param_type": "String", "param_name": ["forKey", "key"], "param_description": ""}]}, {"return_value": {"return_type": ["Bool"], "return_name": [""], "return_description": ["true if the described class has a readable property identified by the specified key; otherwise, false."]}, "method_name": "hasReadableProperty", "class_name": "NSScriptClassDescription", "method_description": "Returns a Boolean value indicating whether the described class has a readable property identified by the specified key.", "params": [{"param_type": "String", "param_name": ["forKey", "key"], "param_description": ""}]}, {"return_value": {"return_type": ["Bool"], "return_name": [""], "return_description": ["true if the described class has a writable property identified by the specified key; otherwise, false."]}, "method_name": "hasWritableProperty", "class_name": "NSScriptClassDescription", "method_description": "Returns a Boolean value indicating whether the described class has a writable property identified by the specified key.", "params": [{"param_type": "String", "param_name": ["forKey", "key"], "param_description": ""}]}, {"return_value": {"return_type": ["String"], "return_name": [""], "return_description": ["The key that corresponds to the property or element class identified by appleEventCode in the receiver or, if none exists, in a class description in the receiver’s superclasses."]}, "method_name": "key", "class_name": "NSScriptClassDescription", "method_description": "Given an Apple event code that identifies a property or element class, returns the key for the corresponding attribute, one-to-one relationship, or one-to-many relationship.", "params": [{"param_type": "FourCharCode", "param_name": ["withAppleEventCode", "appleEventCode"], "param_description": ""}]}, {"return_value": {"return_type": ["String"], "return_name": [""], "return_description": ["The name of the declared type of the attribute or relationship identified by key; for example, “NSString”. Searches in the receiver first, then in any superclass. Returns nil if no match is found."]}, "method_name": "type", "class_name": "NSScriptClassDescription", "method_description": "Returns the name of the declared type of the attribute or relationship identified by the passed key.", "params": [{"param_type": "String", "param_name": ["forKey", "key"], "param_description": ""}]}, {"return_value": {"return_type": ["Selector"], "return_name": [""], "return_description": ["The selector from the receiver for the command specified by commandDescription. Searches in the receiver first, then in any superclass. Returns NULL if no matching selector is found."]}, "method_name": "selector", "class_name": "NSScriptClassDescription", "method_description": "Returns the selector associated with the receiver for the specified command description.", "params": [{"param_type": "NSScriptCommandDescription", "param_name": ["forCommand", "commandDescription"], "param_description": ""}]}, {"return_value": {"return_type": ["Bool"], "return_name": [""], "return_description": ["true if an the receiver or the instance of NSScriptClassDescription of any superclass of the receiver’s class lists the command described by commandDesc among its supported commands; otherwise, false."]}, "method_name": "supportsCommand", "class_name": "NSScriptClassDescription", "method_description": "Returns a Boolean value indicating whether the receiver or any superclass supports the specified command.", "params": [{"param_type": "NSScriptCommandDescription", "param_name": ["commandDescription"], "param_description": ""}]}], "Vars": [{"var_type": "NSScriptClassDescription", "var_description": "Returns the class description instance for the superclass of the receiver’s class.", "var_name": "superclass"}, {"var_type": "String", "var_description": "Returns the name of the class the receiver describes, as provided at initialization time.", "var_name": "className"}, {"var_type": "String", "var_description": "Returns the value of the DefaultSubcontainerAttribute entry of the class dictionary from which the receiver was instantiated.", "var_name": "defaultSubcontainerAttributeKey"}, {"var_type": "String", "var_description": "Returns the name of the Objective-C class instantiated to implement the scripting class.", "var_name": "implementationClassName"}, {"var_type": "String", "var_description": "Returns the name of the receiver’s suite.", "var_name": "suiteName"}, {"var_type": "FourCharCode", "var_description": "Returns the Apple event code associated with the receiver’s class.", "var_name": "appleEventCode"}], "subclass_list": [], "class_description": "A scriptable application provides scriptability information that describes the commands and objects scripters can use in scripts that target the application. That includes information about the classes those scriptable objects are created from.\nAn application’s scriptability information is collected automatically by an instance of NSScriptSuiteRegistry. The registry object creates an NSScriptClassDescription for each class it finds and caches these objects in memory. Cocoa scripting uses registry information in handling scripting requests that target the application.\nA class description instance stores the name, attributes, relationships, and supported commands for a class. For example, a scriptable document class for a drawing application might support attributes such as file and file type, relationships such as collections of circles, rectangles, and lines, and commands such as align and rotate. \nAs with many of the classes in Cocoa’s built-in scripting support, your application may never need to directly work with instances of NSScriptClassDescription. However, one case where you might need access to a class description is if you override objectSpecifier in a scriptable class. For information on how to do this, see Object Specifiers in Cocoa Scripting Guide.\nAnother case where your application may need access to class description information is if you override indicesOfObjectsByEvaluatingWithContainer:count: in a specifier class.\nAlthough you can subclass NSScriptClassDescription, it is unlikely that you would need to do so, or even to create instances of it.\n", "class_name": "NSScriptClassDescription"}