{"package_name": "foundation", "interface_list": ["CVarArg", "Equatable", "Hashable", "NSCopying"], "class_inherit_list": ["NSObject"], "Methods": [{"return_value": {"return_type": ["URL"], "return_name": [""], "return_description": []}, "method_name": "url", "class_name": "NSURLComponents", "method_description": "Returns a URL object derived from the components object.", "params": [{"param_type": "URL", "param_name": ["relativeTo", "baseURL"], "param_description": ""}]}], "Vars": [{"var_type": "String", "var_description": "A URL derived from the components object, in string form.", "var_name": "string"}, {"var_type": "URL", "var_description": "A URL object derived from the components object.", "var_name": "url"}, {"var_type": "String", "var_description": "The fragment URL component (the part after a # symbol), or nil if not present.", "var_name": "fragment"}, {"var_type": "String", "var_description": "The host URL subcomponent, or nil if not present.", "var_name": "host"}, {"var_type": "String", "var_description": "The password URL subcomponent, or nil if not present.", "var_name": "password"}, {"var_type": "String", "var_description": "The path URL component, or nil if not present.", "var_name": "path"}, {"var_type": "NSNumber", "var_description": "The port number URL component, or nil if not present.", "var_name": "port"}, {"var_type": "String", "var_description": "The query URL component as a string, or nil if not present.", "var_name": "query"}, {"var_type": "[URLQueryItem]", "var_description": "The query URL component as an array of name/value pairs.", "var_name": "queryItems"}, {"var_type": "String", "var_description": "The scheme URL component, or nil if not present.", "var_name": "scheme"}, {"var_type": "String", "var_description": "The username URL subcomponent, or nil if not present.", "var_name": "user"}, {"var_type": "String", "var_description": "The fragment URL component (the part after a # symbol) expressed as a URL-encoded string, or nil if not present.", "var_name": "percentEncodedFragment"}, {"var_type": "String", "var_description": "The host URL subcomponent expressed as a URL-encoded string, or nil if not present.", "var_name": "percentEncodedHost"}, {"var_type": "String", "var_description": "The password URL subcomponent expressed as a URL-encoded string, or nil if not present.", "var_name": "percentEncodedPassword"}, {"var_type": "String", "var_description": "The path URL component expressed as a URL-encoded string, or nil if not present.", "var_name": "percentEncodedPath"}, {"var_type": "String", "var_description": "The query URL component expressed as a URL-encoded string, or nil if not present.", "var_name": "percentEncodedQuery"}, {"var_type": "String", "var_description": "The username URL subcomponent expressed as a URL-encoded string, or nil if not present.", "var_name": "percentEncodedUser"}, {"var_type": "[URLQueryItem]", "var_description": "", "var_name": "percentEncodedQueryItems"}, {"var_type": "NSRange", "var_description": "Returns the character range of the fragment in the string returned by the string property.", "var_name": "rangeOfFragment"}, {"var_type": "NSRange", "var_description": "Returns the character range of the host in the string returned by the string property.", "var_name": "rangeOfHost"}, {"var_type": "NSRange", "var_description": "Returns the character range of the password in the string returned by the string property.", "var_name": "rangeOfPassword"}, {"var_type": "NSRange", "var_description": "Returns the character range of the path in the string returned by the string property.", "var_name": "rangeOfPath"}, {"var_type": "NSRange", "var_description": "Returns the character range of the port in the string returned by the string property.", "var_name": "rangeOfPort"}, {"var_type": "NSRange", "var_description": "Returns the character range of the query in the string returned by the string property.", "var_name": "rangeOfQuery"}, {"var_type": "NSRange", "var_description": "Returns the character range of the scheme in the string returned by the string property.", "var_name": "rangeOfScheme"}, {"var_type": "NSRange", "var_description": "Returns the character range of the user in the string returned by the string property.", "var_name": "rangeOfUser"}], "subclass_list": [], "class_description": "The NSURLComponents class is a class that is designed to parse URLs based on RFC 3986 and to construct URLs from their constituent parts. Its behavior differs subtly from the NSURL class, which conforms to older RFCs. However, you can easily obtain an NSURL object based on the contents of a URL components object or vice versa.\nYou create a URL components object in one of three ways: from an NSString object that contains a URL, from an NSURL object, or from scratch by using the default initializer. From there, you can modify the URL’s individual components and subcomponents by modifying various properties, either in unencoded form or in URL-encoded form. If you set the unencoded property, you can then obtain the encoded equivalent by reading the encoded property value and vice versa.\nImportant\nThe Swift overlay to the Foundation framework provides the URLComponents structure, which bridges to the NSURLComponents class. For more information about value types, see Working with Cocoa Frameworks in Using Swift with Cocoa and Objective-C (Swift 4.1).\n", "class_name": "NSURLComponents"}