{"package_name": "foundation", "interface_list": ["OptionSet"], "class_inherit_list": [], "Methods": [], "Vars": [{"var_type": "NSURL.BookmarkCreationOptions", "var_description": "Specifies that when a bookmark created with this option is resolved, its embedded file ID should take precedence over other sources of information (file system path, for example) in the event of a conflict.DeprecatedThis option does nothing and has no effect on bookmark resolution.", "var_name": "preferFileIDResolution"}, {"var_type": "NSURL.BookmarkCreationOptions", "var_description": "Specifies that a bookmark created with this option should be created with minimal information. This produces a smaller bookmark that can be resolved in fewer ways.", "var_name": "minimalBookmark"}, {"var_type": "NSURL.BookmarkCreationOptions", "var_description": "Specifies that the bookmark data should include properties required to create Finder alias files.", "var_name": "suitableForBookmarkFile"}, {"var_type": "NSURL.BookmarkCreationOptions", "var_description": "Specifies that you want to create a security-scoped bookmark that, when resolved, provides a security-scoped URL allowing read/write access to a file-system resource; for use in an app that adopts App Sandbox. For more information, see App Sandbox Design Guide. Note that this flag cannot be used in conjunction with either NSURLBookmarkCreationMinimalBookmark or NSURLBookmarkCreationSuitableForBookmarkFile.", "var_name": "withSecurityScope"}, {"var_type": "NSURL.BookmarkCreationOptions", "var_description": "When combined with the withSecurityScope option, specifies that you want to create a security-scoped bookmark that, when resolved, provides a security-scoped URL allowing read-only access to a file-system resource; for use in an app that adopts App Sandbox. For more information, see App Sandbox Design Guide.", "var_name": "securityScopeAllowOnlyReadAccess"}], "subclass_list": [], "class_description": "When creating a bookmark, use bitwise OR operators to combine the options you want to specify, and provide them to the options parameter of the bookmarkData(options:includingResourceValuesForKeys:relativeTo:) method.\nSecurity-scoped bookmarks are not available in versions of macOS prior to OS X v10.7.3.\n", "class_name": "NSURL.BookmarkCreationOptions"}