{"package_name": "foundation", "interface_list": ["CVarArg", "Equatable", "Hashable"], "class_inherit_list": ["NSObject"], "Methods": [{"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "scheduleNotification", "class_name": "NSUserNotificationCenter", "method_description": "Schedules the specified user notification.", "params": [{"param_type": "NSUserNotification", "param_name": ["notification"], "param_description": ""}]}, {"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "removeScheduledNotification", "class_name": "NSUserNotificationCenter", "method_description": "Removes the specified user notification for the scheduled notifications.", "params": [{"param_type": "NSUserNotification", "param_name": ["notification"], "param_description": ""}]}, {"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "deliver", "class_name": "NSUserNotificationCenter", "method_description": "Deliver the specified user notification.", "params": [{"param_type": "NSUserNotification", "param_name": ["notification"], "param_description": ""}]}, {"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "removeDeliveredNotification", "class_name": "NSUserNotificationCenter", "method_description": "Remove a delivered user notification from the user notification center.", "params": [{"param_type": "NSUserNotification", "param_name": ["notification"], "param_description": ""}]}, {"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "removeAllDeliveredNotifications", "class_name": "NSUserNotificationCenter", "method_description": "Remove all delivered user notifications from the user notification center.", "params": []}], "Vars": [{"var_type": "NSUserNotificationCenter", "var_description": "Returns the default user notification center.", "var_name": "`default`"}, {"var_type": "[NSUserNotification]", "var_description": "Specifies an array of scheduled user notifications that have not yet been delivered.", "var_name": "scheduledNotifications"}, {"var_type": "[NSUserNotification]", "var_description": "An array of all user notifications delivered to the notification center.", "var_name": "deliveredNotifications"}, {"var_type": "NSUserNotificationCenterDelegate", "var_description": "Specifies the notification center delegate.", "var_name": "delegate"}], "subclass_list": [], "class_description": "When a user notification’s delivery date has been reached, or it is manually delivered, the notification center may display the notification to the user. The user notification center reserves the right to decide if a delivered user notification is presented to the user. For example, it may suppress the notification if the application is already frontmost (the delegate can override this action). The application can check the result of this decision by examining the isPresented property of a delivered user notification.\nNSUserNotification instances the NSUserNotificationCenter are tracking will be in one of two states: scheduled or delivered. A scheduled user notification has a deliveryDate. On that delivery date, the notification will move from being scheduled to being delivered. Note that the user notification may be displayed later than the delivery date depending on a number of factors.\nA delivered user notification has an actualDeliveryDate. That is the date when it moved from being scheduled to delivered, or when it was manually delivered using the deliver(_:) method.\nThe application and the user notification center are both ultimately subject to the user’s preferences. If the user decides to hide all alerts from your application, the presented property will still behave as above, but the user will not see any animation or hear any sound.\nThe NSUserNotificationCenterDelegate provides more information about the delivered user notification and allows forcing the display of a user notification even if the application is frontmost. \nNote\nIt the user wakes more than 15 minutes after a scheduled notification is scheduled to fire, it is discarded.  If the notification repeats with an interval less than 15 minutes, then it expires in 1 minute.  Expired notifications are just discarded, unless they repeat, in which case, they stay in the scheduled list and just fire again later.\nImportant\nMany of the NSUserNotificationCenter class’s methods involve talking to a server process, so calling them repeatedly can have a negative effect on performance.\nThe NSUserNotificationCenter class and the NSUserNotification class are both thread safe.\n", "class_name": "NSUserNotificationCenter"}