{"package_name": "foundation", "interface_list": ["CVarArg", "Equatable", "Hashable"], "class_inherit_list": ["NSObject"], "Methods": [{"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "addUserInfoEntries", "class_name": "NSUserActivity", "method_description": "Adds the contents of the specified dictionary to the user info dictionary.", "params": [{"param_type": "Any]", "param_name": ["from", "otherDictionary"], "param_description": ""}]}, {"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "becomeCurrent", "class_name": "NSUserActivity", "method_description": "Marks the activity as currently in use by the user.", "params": []}, {"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "resignCurrent", "class_name": "NSUserActivity", "method_description": "Marks this activity object as inactive without invalidating it.", "params": []}, {"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "invalidate", "class_name": "NSUserActivity", "method_description": "Invalidates an activity and marks it as no longer eligible for continuation.", "params": []}, {"return_value": {"return_type": ["Void"], "return_name": [""], "return_description": []}, "method_name": "deleteAllSavedUserActivities", "class_name": "NSUserActivity", "method_description": "Deletes all user activities created by your app.", "params": [{"param_type": "@escaping (", "param_name": ["completionHandler", "handler"], "param_description": ""}]}, {"return_value": {"return_type": ["Void"], "return_name": [""], "return_description": []}, "method_name": "deleteSavedUserActivities", "class_name": "NSUserActivity", "method_description": "Deletes user activities created by your app that have the specified persistent identifiers.", "params": [{"param_type": "[NSUserActivityPersistentIdentifier]", "param_name": ["withPersistentIdentifiers", "persistentIdentifiers"], "param_description": ""}, {"param_type": "@escaping (", "param_name": ["completionHandler", "handler"], "param_description": ""}]}, {"return_value": {"return_type": ["Void"], "return_name": [""], "return_description": []}, "method_name": "getContinuationStreams", "class_name": "NSUserActivity", "method_description": "Requests streams back to the originating app.", "params": [{"param_type": "@escaping (InputStream", "param_name": ["completionHandler"], "param_description": ""}, {"param_type": "OutputStream", "param_name": ["OutputStream"], "param_description": ""}, {"param_type": "Error", "param_name": ["Error"], "param_description": ""}]}], "Vars": [{"var_type": "String", "var_description": "The activity type with which the user activity object was created.", "var_name": "activityType"}, {"var_type": "String", "var_description": "An optional, user-visible title for this activity, such as a document name or web page title.", "var_name": "title"}, {"var_type": "Set<String>", "var_description": "A set of keys that represent the minimal information about the activity that should be stored for later restoration.", "var_name": "requiredUserInfoKeys"}, {"var_type": "[AnyHashable", "var_description": "A dictionary containing app-specific state information needed to continue an activity on another device.", "var_name": "userInfo"}, {"var_type": "Bool", "var_description": "Indicates that the state of the activity needs to be updated.", "var_name": "needsSave"}, {"var_type": "CSSearchableItemAttributeSet", "var_description": "A set of properties that describe the activity.", "var_name": "contentAttributeSet"}, {"var_type": "Set<String>", "var_description": "A set of localized keywords that can help users find the activity in search results.", "var_name": "keywords"}, {"var_type": "NSUserActivityPersistentIdentifier", "var_description": "A value used to identify the user activity.", "var_name": "persistentIdentifier"}, {"var_type": "Bool", "var_description": "A Boolean value that indicates whether the activity can be continued on another device using Handoff.", "var_name": "isEligibleForHandoff"}, {"var_type": "Bool", "var_description": "A Boolean value that indicates whether the activity should be added to the on-device index. ", "var_name": "isEligibleForSearch"}, {"var_type": "Bool", "var_description": "A Boolean value that indicates whether the activity can be publicly accessed by all iOS users.", "var_name": "isEligibleForPublicIndexing"}, {"var_type": "Date", "var_description": "The date after which the activity is no longer eligible for Handoff or indexing.", "var_name": "expirationDate"}, {"var_type": "NSUserActivityDelegate", "var_description": "The user activity object’s delegate.", "var_name": "delegate"}, {"var_type": "URL", "var_description": "Webpage to load in a browser to continue the activity.", "var_name": "webpageURL"}, {"var_type": "Bool", "var_description": "A Boolean value that determines whether Siri can suggest the user activity as a shortcut to the user.", "var_name": "isEligibleForPrediction"}, {"var_type": "String", "var_description": "A phrase suggested to the user when they create a shortcut.", "var_name": "suggestedInvocationPhrase"}, {"var_type": "INInteraction", "var_description": "The SiriKit interaction object to use when configuring your app. ", "var_name": "interaction"}, {"var_type": "Bool", "var_description": "A Boolean value that determines whether the continuing app can request streams to be opened back to the originating app.", "var_name": "supportsContinuationStreams"}, {"var_type": "NFCNDEFMessage", "var_description": "The NDEF message read by the system in the background.", "var_name": "ndefMessagePayload"}, {"var_type": "MKMapItem!", "var_description": "Attaches the specified map item to a user activity object. ", "var_name": "mapItem"}, {"var_type": "String", "var_description": "An activity that continues from Handoff or a universal link.", "var_name": "NSUserActivityTypeBrowsingWeb"}, {"var_type": "Int", "var_description": "", "var_name": "NSUserActivityConnectionUnavailableError"}, {"var_type": "Int", "var_description": "", "var_name": "NSUserActivityErrorMaximum"}, {"var_type": "Int", "var_description": "", "var_name": "NSUserActivityErrorMinimum"}, {"var_type": "Int", "var_description": "", "var_name": "NSUserActivityHandoffFailedError"}, {"var_type": "Int", "var_description": "", "var_name": "NSUserActivityHandoffUserInfoTooLargeError"}, {"var_type": "Int", "var_description": "", "var_name": "NSUserActivityRemoteApplicationTimedOutError"}, {"var_type": "[String]", "var_description": "The identifier path associated with a user activity generated by an app that adopts ClassKit.", "var_name": "contextIdentifierPath"}, {"var_type": "CIBarcodeDescriptor", "var_description": "", "var_name": "detectedBarcodeDescriptor"}, {"var_type": "String", "var_description": "", "var_name": "externalMediaContentIdentifier"}, {"var_type": "Bool", "var_description": "Indicates whether a user activity represents a ClassKit context.", "var_name": "isClassKitDeepLink"}, {"var_type": "URL", "var_description": "", "var_name": "referrerURL"}], "subclass_list": [], "class_description": "An NSUserActivity object provides a lightweight way to capture the state of your app and put it to use later. You create user activity objects and use them to capture information about what the user was doing, such as viewing app content, editing a document, viewing a web page, or watching a video. When the system launches your app and an activity object is available, your app can use the information in that object to restore itself to an appropriate state. Spotlight also uses your user activity objects to improve search results for the user. \nYou create NSUserActivity objects at key moments and register them with the system. For example, you might create a user activity object when the user opens a web page, when your app moves to the background, or when the user performs some other significant task in your app. User activity objects are not intended as a way to track every task in your app, so you should not use them for small edits or other minor changes. Instead, use them for significant checkpoints that the user might want to continue later or on another device. You can also use them to provide better Spotlight search results.\nWhen creating a user activity object, do the following:\nCreate and initialize the user activity object with an appropriate activity type. (You define the activity types your app supports.)\nSet the title of the user activity object.\nConfigure the tasks for which the object is eligible by enabling one or more of the following properties:\nisEligibleForHandoff\nisEligibleForSearch\nisEligibleForPublicIndexing\nConfigure the properties of this object that relate to the user’s current activity.\nFor user activity objects configured for search or public indexing, configure the contentAttributeSet, keywords, or webpageURL properties so that Spotlight can index the object.\nCall the becomeCurrent() method to register the user activity object with the system.\nWhen you create an NSUserActivity object, you specify a string that identifies the type of the activity. Activity type strings are typically in reverse-DNS format. For example, when the user opens a web page, you might specify an activity string such as com.myCompany.myApp.OpenWebPage. You must declare the activity types that your app supports by including the NSUserActivityTypes key in its Info.plist file. The system uses the information in that key to determine whether your app is capable of handing a given user activity object.\nThe system associates user activity objects with the ID of the developer that created them. When continuing an activity, the system looks for an app that supports the given activity type and has the same developer Team ID as the activity’s source app. Tying activity objects to your developer Team ID ensures that the activities you create cannot be intercepted by a competitor’s app. Relying on the Team ID also means that your apps must be distributed through the App Store or be signed with your developer ID. \nHandoff is a technology that lets users begin an activity on one device and continue it on another. For Handoff, user activity objects convey information about what the user was doing in one context so that it can be used in another context. For example, a user who is watching a video on an iPad can start continue watching the video from the same point on their Mac. In that example, the user activity object contains information about the video that the user was watching and the place where they stopped watching it on the iPad.\nTo support Handoff, configure your user activity objects with the data needed to continue the activity and set the isEligibleForHandoff property to true. \nIf SiriKit needs to launch your app for any reason, it creates a user activity object and assigns an appropriate INInteraction object to its interaction property. Your app can use the interaction information to configure itself and display information related to the interaction started by SiriKit. You can also provide SiriKit with a custom user activity object containing additional data that you want passed to your app.\nFor more information about using NSUserActivity objects with SiriKit, see SiriKit Programming Guide. \nIf your NSUserActivity objects contain information that the user might want to search for later, set the isEligibleForSearch property to true. When you enable search, Spotlight indexes your user activity objects and considers them during subsequent on-device searches. For example, if the user viewed information about a particular restaurant in your app, you would enable search for the corresponding user activity object. Subsequent searches for restaurants using Spotlight could then include the results obtained from your user activity object.\nIn addition to on-device searches, you can contribute URLs accessed by your app with the global Spotlight search engine. Sharing a URL helps Spotlight improve its own search results for other users. To contribute a URL, put the URL in the webpageURL property of your activity object and set the isEligibleForPublicIndexing property to true.\nImportant\nYour app must maintain a strong reference to any activity objects that you use for search results.\nUser activity objects are intended only for recording user-initiated activities. They are not intended as a general-purpose indexing mechanism for your app’s data. To index all of your app’s content, and not just the content touched by the user, use the APIs of the Core Spotlight framework. For more information, see Core Spotlight.\n", "class_name": "NSUserActivity"}