{"package_name": "foundation", "interface_list": ["CVarArg", "Equatable", "Hashable", "NSCopying", "NSSecureCoding"], "class_inherit_list": ["NSObject"], "Methods": [{"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "getValue", "class_name": "NSValue", "method_description": "Copies the value into the specified buffer.", "params": [{"param_type": "UnsafeMutableRawPointer", "param_name": ["value"], "param_description": ""}]}, {"return_value": {"return_type": ["Bool"], "return_name": [""], "return_description": ["true if both value objects are equal; otherwise, false. "]}, "method_name": "isEqual", "class_name": "NSValue", "method_description": "Returns a Boolean value that indicates whether the value object and another value object are equal.", "params": [{"param_type": "NSValue", "param_name": ["to", "value"], "param_description": ""}]}, {"return_value": {"return_type": [], "return_name": [], "return_description": []}, "method_name": "getValue", "class_name": "NSValue", "method_description": "", "params": [{"param_type": "UnsafeMutableRawPointer", "param_name": ["value"], "param_description": ""}, {"param_type": "Int", "param_name": ["size"], "param_description": ""}]}], "Vars": [{"var_type": "UnsafePointer<Int8>", "var_description": "A C string containing the Objective-C type of the data contained in the value object.", "var_name": "objCType"}, {"var_type": "UnsafeMutableRawPointer", "var_description": "Returns the value as an untyped pointer.", "var_name": "pointerValue"}, {"var_type": "Any", "var_description": "The value as a non-retained pointer to an object.", "var_name": "nonretainedObjectValue"}, {"var_type": "NSRange", "var_description": "The Foundation range structure representation of the value.", "var_name": "rangeValue"}, {"var_type": "NSPoint", "var_description": "The Foundation point structure representation of the value.", "var_name": "pointValue"}, {"var_type": "NSSize", "var_description": "The Foundation size structure representation of the value.", "var_name": "sizeValue"}, {"var_type": "NSRect", "var_description": "The Foundation rectangle structure representation of the value.", "var_name": "rectValue"}, {"var_type": "CGPoint", "var_description": "Returns the CoreGraphics point structure representation of the value.", "var_name": "cgPointValue"}, {"var_type": "CGVector", "var_description": "Returns the CoreGraphics vector structure representation of the value.", "var_name": "cgVectorValue"}, {"var_type": "CGSize", "var_description": "Returns the CoreGraphics size structure representation of the value.", "var_name": "cgSizeValue"}, {"var_type": "CGRect", "var_description": "Returns the CoreGraphics rectangle structure representation of the value.", "var_name": "cgRectValue"}, {"var_type": "CGAffineTransform", "var_description": "Returns the CoreGraphics affine transform representation of the value.", "var_name": "cgAffineTransformValue"}, {"var_type": "UIEdgeInsets", "var_description": "Returns the UIKit edge insets structure representation of the value.", "var_name": "uiEdgeInsetsValue"}, {"var_type": "UIOffset", "var_description": "Returns the UIKit offset structure representation of the value.", "var_name": "uiOffsetValue"}, {"var_type": "CATransform3D", "var_description": "The CoreAnimation transform structure representation of the value.", "var_name": "caTransform3DValue"}, {"var_type": "CMTime", "var_description": "The CoreMedia time structure representation of the value.", "var_name": "timeValue"}, {"var_type": "CMTimeRange", "var_description": "The CoreMedia time range structure representation of the value.", "var_name": "timeRangeValue"}, {"var_type": "CMTimeMapping", "var_description": "The CoreMedia time mapping structure representation of the value.", "var_name": "timeMappingValue"}, {"var_type": "CLLocationCoordinate2D", "var_description": "The CoreLocation geographic coordinate structure representation of the value.", "var_name": "mkCoordinateValue"}, {"var_type": "MKCoordinateSpan", "var_description": "The MapKit coordinate span structure representation of the value.", "var_name": "mkCoordinateSpanValue"}, {"var_type": "SCNVector3", "var_description": "The three-element Scene Kit vector representation of the value.", "var_name": "scnVector3Value"}, {"var_type": "SCNVector4", "var_description": "The four-element Scene Kit vector representation of the value.", "var_name": "scnVector4Value"}, {"var_type": "SCNMatrix4", "var_description": "The Scene Kit 4 x 4 matrix representation of the value.", "var_name": "scnMatrix4Value"}, {"var_type": "NSDirectionalEdgeInsets", "var_description": "", "var_name": "directionalEdgeInsetsValue"}, {"var_type": "NSEdgeInsets", "var_description": "", "var_name": "edgeInsetsValue"}], "subclass_list": [], "class_description": "An NSValue object can hold any of the scalar types such as int, float, and char, as well as pointers, structures, and object id references. Use this class to work with such data types in collections (such as NSArray and NSSet), Key-value coding, and other APIs that require Objective-C objects. NSValue objects are always immutable.\nThe abstract NSValue class is the public interface of a class cluster consisting mostly of private, concrete classes that create and return a value object appropriate for a given situation. It is possible to subclass NSValue, but doing so requires providing storage facilities for the value (which is not inherited by subclasses) and implementing two primitive methods.\nAny subclass of NSValue must override the primitive instance methods getValue(_:) and objCType. These methods must operate on the storage that you provide for the value.\nYou might want to implement an initializer for your subclass that is suited to the storage you provide. The NSValue class does not have a designated initializer, so your initializer need only invoke the init() method of super. The NSValue class adopts the NSCopying and NSSecureCoding protocols; if you want instances of your own custom subclass created from copying or coding, override the methods in these protocols.\nYou may also wish to implement the hash method to make your subclass work well in collections.\nIf you need only to use NSValue objects for wrap a custom data types or structures defined by your app, you need not create an NSValue subclass. Instead, create a category that uses existing NSValue methods to store and retrieve data of your custom type. For example, the code below defines a custom Polyhedron structure and creates NSValue convenience methods to store and retrieve it:\n", "class_name": "NSValue"}