{"package_name": "foundation", "interface_list": ["CVarArg", "Equatable", "Hashable"], "class_inherit_list": ["NSScriptObjectSpecifier"], "Methods": [], "Vars": [{"var_type": "NSWhoseSpecifier.SubelementIdentifier", "var_description": "Sets the end sub-element identifier for the specifier to the value of a given sub-element.", "var_name": "endSubelementIdentifier"}, {"var_type": "Int", "var_description": "Sets the index position of the last sub-element within the range of objects being tested that pass the specifier’s test.", "var_name": "endSubelementIndex"}, {"var_type": "NSWhoseSpecifier.SubelementIdentifier", "var_description": "Returns the start sub-element identifier for the receiver.", "var_name": "startSubelementIdentifier"}, {"var_type": "Int", "var_description": "Returns the index position of the first sub-element within the range of objects being tested that pass the receiver's test.", "var_name": "startSubelementIndex"}, {"var_type": "NSScriptWhoseTest", "var_description": "Returns the test object encapsulated by the receiver.", "var_name": "test"}], "subclass_list": [], "class_description": "NSWhoseSpecifier specifies every object in a collection (or every element in a container) that matches the condition defined by a single Boolean expression or multiple Boolean expressions connected by logical operators. NSWhoseSpecifier is unique among object specifiers in that its top-level container is typically not the application object but an evaluated object specifier involved in the tested-for condition. An NSWhoseSpecifier object encapsulates a “test” object for defining this condition. A test object is instantiated from a subclass of the abstract NSScriptWhoseTest class, whose one declared method is isTrue(). See \"Boolean Expressions and Logical Operations\" in NSScriptObjectSpecifier and the descriptions in NSComparisonMethods and NSScriptingComparisonMethods for more information.\nThe set of elements specified by an NSWhoseSpecifier object can be a subset of those that pass the NSWhoseSpecifier object's test. This subset is specified by the various sub-element properties of the NSWhoseSpecifier object . Consider as an example the specifier paragraphs where color of third word is blue. This would be represented by an NSWhoseSpecifier object  that uses a test specifier and another object specifier to identify a subset of the objects with the specified property. That is, the specifier’s property is paragraphs; the test specifier is an index specifier with property words and index 3; and the qualifier is a key value qualifier for key color and value [NSColor blueColor]. The test object specifier (word at index 3) is evaluated for each object (paragraph) using that object as the container; the resulting objects (if any) are tested with the qualifier (color blue).\nNSWhoseSpecifier is part of Cocoa’s built-in script handling. You don’t normally subclass it.\n", "class_name": "NSWhoseSpecifier"}