{"package_name": "foundation", "interface_list": ["CVarArg", "Equatable", "Hashable"], "class_inherit_list": ["Stream"], "Methods": [{"return_value": {"return_type": ["Self"], "return_name": [""], "return_description": ["An initialized output stream that will write stream data to memory."]}, "method_name": "toMemory", "class_name": "OutputStream", "method_description": "Creates and returns an initialized output stream that will write stream data to memory.", "params": []}, {"return_value": {"return_type": ["Int"], "return_name": [""], "return_description": ["A number indicating the outcome of the operation:"]}, "method_name": "write", "class_name": "OutputStream", "method_description": "Writes the contents of a provided data buffer to the receiver.", "params": [{"param_type": "UnsafePointer<UInt8>", "param_name": ["buffer"], "param_description": ""}, {"param_type": "Int", "param_name": ["maxLength", "len"], "param_description": ""}]}], "Vars": [{"var_type": "Bool", "var_description": "A boolean value that indicates whether the receiver can be written to.", "var_name": "hasSpaceAvailable"}], "subclass_list": [], "class_description": "OutputStream is “toll-free bridged” with its Core Foundation counterpart, CFWriteStream. For more information on toll-free bridging, see Toll-Free Bridging.\nNSOutputStream is a concrete subclass of NSStream that lets you write data to a stream. Although NSOutputStream is probably sufficient for most situations requiring this capability, you can create a subclass of NSOutputStream if you want more specialized behavior (for example, you want to record statistics on the data in a stream).\nTo create a subclass of NSOutputStream you may have to implement initializers for the type of stream data supported and suitably reimplement existing initializers. You must also provide complete implementations of the following methods:\nwrite(_:maxLength:)\nFrom the current write pointer, take up to the number of bytes specified in the maxLength: parameter from the client-supplied buffer (first parameter) and put them onto the stream. The buffer must be of the size specified by the second parameter. To prepare for the next operation, offset the write pointer by the number of bytes written. Return a signed integer based on the outcome of the current operation:\nIf the write operation is successful, return the actual number of bytes put onto the stream.\nIf the stream is of a fixed length and has reached its capacity, return 0.\nIf there was an error writing to the stream, return -1.\nhasSpaceAvailable\nReturn true if the stream can currently accept more data, false if it cannot. If you want to be semantically compatible with NSOutputStream, return true if a write must be attempted to determine if space is available.\n", "class_name": "OutputStream"}