{"package_name": "foundation", "interface_list": ["CVarArg", "Equatable", "Hashable"], "class_inherit_list": ["Formatter"], "Methods": [{"return_value": {"return_type": ["String"], "return_name": [""], "return_description": ["A formatted string representation of the given name components."]}, "method_name": "localizedString", "class_name": "PersonNameComponentsFormatter", "method_description": "Returns a string formatted for a given NSPersonNameComponents object using the provided style and options.", "params": [{"param_type": "PersonNameComponents", "param_name": ["from", "components"], "param_description": ""}, {"param_type": "PersonNameComponentsFormatter.Style", "param_name": ["style", "nameFormatStyle"], "param_description": ""}, {"param_type": "PersonNameComponentsFormatter.Options", "param_name": ["options", "nameOptions"], "param_description": ""}]}, {"return_value": {"return_type": ["String"], "return_name": [""], "return_description": ["A formatted string representation of the given name components."]}, "method_name": "string", "class_name": "PersonNameComponentsFormatter", "method_description": "Returns a string formatted for a given NSPersonNameComponents object.", "params": [{"param_type": "PersonNameComponents", "param_name": ["from", "components"], "param_description": ""}]}, {"return_value": {"return_type": ["NSAttributedString"], "return_name": [""], "return_description": ["An attributed string representation of the given name components. You can determine the person component corresponding to a particular range of the attributed string by querying the NSPersonNameComponentKey attribute, providing one of the NSPersonNameComponent constant values defined below as the attribute value."]}, "method_name": "annotatedString", "class_name": "PersonNameComponentsFormatter", "method_description": "Returns an attributed string formatted for a given NSPersonNameComponents object, with attribute annotations for each component.", "params": [{"param_type": "PersonNameComponents", "param_name": ["from", "components"], "param_description": ""}]}, {"return_value": {"return_type": ["PersonNameComponents"], "return_name": [""], "return_description": ["An NSPersonNameComponents object parsing string using the receiver’s format, or nil if no components could be parsed."]}, "method_name": "personNameComponents", "class_name": "PersonNameComponentsFormatter", "method_description": "Returns a person name components object from a given string.", "params": [{"param_type": "String", "param_name": ["from", "string"], "param_description": ""}]}, {"return_value": {"return_type": ["Bool"], "return_name": [""], "return_description": ["true if conversion succeeded; otherwise false."]}, "method_name": "getObjectValue", "class_name": "PersonNameComponentsFormatter", "method_description": "Returns by reference a person name components object after creating it from a given string.", "params": [{"param_type": "AutoreleasingUnsafeMutablePointer<AnyObject>", "param_name": ["obj"], "param_description": ""}, {"param_type": "String", "param_name": ["for", "string"], "param_description": ""}, {"param_type": "AutoreleasingUnsafeMutablePointer<NSString>", "param_name": ["errorDescription", "error"], "param_description": ""}]}], "Vars": [{"var_type": "PersonNameComponentsFormatter.Style", "var_description": "The formatting style of the receiver.", "var_name": "style"}, {"var_type": "Bool", "var_description": "A Boolean value that specifies whether the receiver should use only the phonetic representations of name components. false by default.", "var_name": "isPhonetic"}, {"var_type": "String", "var_description": "", "var_name": "NSPersonNameComponentKey"}, {"var_type": "String", "var_description": "", "var_name": "NSPersonNameComponentGivenName"}, {"var_type": "String", "var_description": "", "var_name": "NSPersonNameComponentFamilyName"}, {"var_type": "String", "var_description": "", "var_name": "NSPersonNameComponentMiddleName"}, {"var_type": "String", "var_description": "", "var_name": "NSPersonNameComponentPrefix"}, {"var_type": "String", "var_description": "", "var_name": "NSPersonNameComponentSuffix"}, {"var_type": "String", "var_description": "", "var_name": "NSPersonNameComponentNickname"}, {"var_type": "String", "var_description": "", "var_name": "NSPersonNameComponentDelimiter"}], "subclass_list": [], "class_description": "Each locale has its own set of rules and conventions for how personal names are structured and represented. These rules vary widely across different locales in a several ways, including the sort and display order of given and family names, the use of salutations and honorifics, and other concerns related to the grammar, spelling, punctuation, and formatting. About the only thing that is consistent across all locales is that personal names are significant and meaningful. For this reason, names deserve careful and respectful treatment—perhaps more than any other kind of information your app interacts with.\nFormatters can be configured to represent names in a variety of styles, which are described in detail below.\nDefault (PersonNameComponentsFormatter.Style.default)\nShort (PersonNameComponentsFormatter.Style.short)\nLong (PersonNameComponentsFormatter.Style.long)\nAbbreviated (PersonNameComponentsFormatter.Style.abbreviated)\nWhen determining how to represent a name in a particular style, a formatter takes a number of factors into consideration, in order of priority:\nScript derived behaviors Scripts may specify a strict sort or display order of given and family names, and the availability of styles.\nUser specified preferences Users can enable and configure the display of short names, as well as whether or not to display nicknames when available. Users can also override the default sort and display order of given and family names for their current locale.\nLocale derived defaults Locales specify a default sort and display order for given and family names.\nDeveloper specified configuration The style property value set for the NSPersonNameComponentsFormatter object.\nWhen the behavior specified in one factor conflicts with any other factors, the behavior specified by the factor with the most precedence is used. For example, the U.S. English (en-US) locale specifies that names be displayed in “given name followed by the family name” (for example,“John Appleseed”). This behavior would be overridden if the user changed their system preferences to have names displayed as family name followed by given name (for example, “Appleseed, John”), because user-specified preferences take precedence over locale-derived defaults. Furthermore, if the name to be formatted were Japanese (for example, given name: “泰夫”, family name: “木田”), the behavior derived for the name’s script (CJK, for Chinese, Japanese, and Korean languages) would take precedence over any locale-derived defaults or user-specified preferences to have the name displayed as family name followed by given name (for example, “木田 泰夫”).\nThese considerations extend to the availability of certain formatter styles as well. Because developer-specified configurations have the lowest precedence in determining behavior, the value set for the formatter’s style property can be invalidated if it’s not supported for the locale, user preferences, or script. If the specified style is not available, the next longest valid style is used. For example, a name in Arabic script (for example, “أحمد الراجحي”) does not support the Abbreviated style, so the Short style is used instead.\nNote\nA name that contains more than one script (for example, given name: “John”, family name: “王”) is detected to have “Unknown” script, which has its own set of behaviors and characteristics.\nNSPersonNameComponentsFormatter can be configured to format names in the following styles:\nThe minimally necessary features for differentiation in a casual setting. Equivalent to PersonNameComponentsFormatter.Style.medium.\nRelies on user preferences and language defaults to display shortened form appropriate for display in space-constrained settings.\nThe fully qualified name complete with all known components.\nThe maximally abbreviated form of a name.\nName components used to demonstrate the display of each style for various names and locales. \n\nnamePrefix\ngivenName\nmiddleName\nfamilyName\nnameSuffix\nnickname\nArabic \n(ar-SA)\n.د\nأحمد \n\nمحمدالمصري \n\n\nChinese \n(zh-Hans)\n物理学博士\n振宁\n\n杨\n先生\n\nEnglish \n(en-US)\nDr.\nJonathan\nMaple\nAppleseed\nEsq.\nJohnny\nFrench \n(fr-FR)\nPère\nJean-Philippe\n\nde Zélicourt\n\nJP\nGerman \n(de-DE)\nDr. med.\nMax\n\nMustermann\njunior, M.A.\n\nHindi \n(hi-IN)\nडॉ.\nरिय\n\nसाहिल\n\n\nJapanese \n(ja-JP)\n\n泰夫\n\n木田\n先生\n\nSpanish \n(es-ES)\nDr.\nJosé Ramiro\n\nMartín González de Rivera\njúnior, PhD\nRamiro\nThai \n(th-TH)\nฯพณฯ\nสมชาย\nปีเตอร์\nรัตนเรืองรองบวรทิพย์\n\n\nThe Default, or Medium, style presents names in a way that is suitable for most contexts. It uses the given and family names, as well as a nickname, if provided and enabled by the user in System Preferences.\n\nDefault style\nArabic (ar-SA)\nأحمد محمﺩﺍلمصﺭﻱ\nChinese (zh-Hans)\n杨振宁\nEnglish (en-US)\nJonathan Appleseed\nFrench (fr-FR)\nJean-Philippe de Zélicourt\nGerman (de-DE)\nMax Mustermann\nHindi (hi-IN)\nरिय साहिल\nJapanese (ja-JP)\n木田泰夫\nSpanish (es-ES)\nJosé Ramiro Martín González de Rivera\nThai (th-TH)\nสมชาย รัตนเรืองรอง บวรทิพย์\nThe Short style offers an alternative display method for names whose default representation may exceed a certain length constraint. It is only available if the user has enabled “Short Names” in System Preferences, and only for names with a script that supports Short style. Otherwise, a formatter configured to display with Short style is displayed with Medium style instead.\nIf a user has enabled the use of short names, the user can choose from one of four variations:\nGiven Name - Family Initial\nFamily Name - Given Initial\nGiven Name Only\nFamily Name Only\nShort style is not available for names in CJK script and is restricted to Given Name Only or Family Name Only for names in Arabic or Devanagari script. If the specified Short style is unavailable, the Medium style is used instead.\n\nGiven Name - Family Initial\nFamily Name - Given Initial\nGiven Name Only\nFamily Name Only\nArabic (ar-SA)\nN/A\nN/A\nأحمد\nمحمﺩﺍلمصﺭﻱ\nChinese (zh-Hans)\nN/A\nN/A\nN/A\nN/A\nEnglish (en-US)\nJonathan A\nJ Appleseed\nJonathan\nAppleseed\nFrench (fr-FR)\nJean-Philippe d\nJ de Zélicourt\nJean-Philippe\nde Zélicourt\nGerman (de-DE)\nMax M\nM Mustermann\nMax\nMustermann\nHindi (hi-IN)\nN/A\nN/A\nरिय\nसाहिल\nJapanese (ja-JP)\nN/A\nN/A\nN/A\nN/A\nSpanish (es-ES)\nJosé Ramiro M\nJ Martín González de Rivera\nJosé Ramiro\nMartín González de Rivera\nThai (th-TH)\nสมชาย ร\nส รัตนเรืองรองบวรทิพย์\nสมชาย\nรัตนเรืองรองบวรทิพย์\nImportant\nNSPersonNameComponentsFormatter does not currently account for prepositional particles. Representations using the Short style that specify a family name initial naively use the first letter unit of the particle as the initial.\nThe Long style provides the most explicit representation of names. It uses all available name components, with the exception of nickname.\n\nLong style\nArabic (ar-SA)\nﺩ. أحمد محمﺩﺍلمصﺭﻱ\nChinese (zh-Hans)\n物理学博士杨振宁先生\nEnglish (en-US)\nDr. Jonathan Maple Appleseed Esq.\nFrench (fr-FR)\nPère Jean-Philippe de Zélicourt\nGerman (de-DE)\nDr. med. Max Mustermann junior, M.A.\nHindi (hi-IN)\nडॉ. रिय साहिल\nJapanese (ja-JP)\n木田泰夫先生\nSpanish (es-ES)\nDr. José Ramiro Martín González de Rivera júnior, PhD\nThai (th-TH)\nฯพณฯ สมชาย ปีเตอร์ รัตนเรืองรอง บวรทิพย์\nThe Abbreviated style offers the most compact representation of names, similar to a monogram.\nAbbreviated style is supported for names in several scripts, with the following general characteristics:\nFor names in Cyrillic, Greek, or Latin script, the first characters of givenName, middleName, and familyName may be used.\nFor names in Chinese or Japanese script, familyName may be used. If familyName is too long, or if the family name is nil, the Short or Medium style may be used instead.\nFor names in Korean script, givenName may be used. If givenName is too long, the first character of givenName may be used. If givenName is nil, the familyName may be used instead.\nFor names in Bengali, Devanagari, Gujarati, Gurmukhi, Kannada, Malayalam, Oriya, Sinhala, Tamil, Telugu, Tibetan, or Thai script, the first character of givenName may be used. If givenName is nil, the first character of familyName may be used instead.\nFor names that contain more than one script, the abbreviated style may use the familyName, givenName, or the first characters of givenName and/or familyName.\nIf the Abbreviated style is unavailable, the Short style is used instead—unless that too is unsupported, in which case the Medium style is used instead.\n\nAbbreviated style\nArabic (ar-SA)\nN/A\nChinese (zh-Hans)\n杨\nEnglish (en-US)\nJMA\nFrench (fr-FR)\nJd\nGerman (de-DE)\nMM\nHindi (hi-IN)\nमि\nJapanese (ja-JP)\n木田\nSpanish (es-ES)\nJM\nThai (th-TH)\nส\nImportant\nNSPersonNameComponentsFormatter doesn’t currently account for prepositional particles or compound names. Representations using the Abbreviated style uses the first letter unit of each name component, regardless.\n", "class_name": "PersonNameComponentsFormatter"}