{"package_name": "foundation", "interface_list": ["Equatable", "Hashable", "RawRepresentable"], "class_inherit_list": [], "Methods": [], "Vars": [{"var_type": "ProgressUserInfoKey", "var_description": "The corresponding value is an NSNumber instance representing the time remaining, in seconds.", "var_name": "estimatedTimeRemainingKey"}, {"var_type": "ProgressUserInfoKey", "var_description": "The corresponding value is an NSNumber instance indicating the speed of data processing, in bytes per second.", "var_name": "throughputKey"}, {"var_type": "ProgressUserInfoKey", "var_description": "The corresponding value must be an NSImage, typically an icon to represent the file. This entry is optional, but if present along with a value for fileAnimationImageOriginalRectKey, and the Dock has an item for the folder containing the relevant file (such as the Downloads folder), the Dock will use them to show an animation of the file flying into the Dock, before invoking acknowledgeWithSuccess:.", "var_name": "fileAnimationImageKey"}, {"var_type": "ProgressUserInfoKey", "var_description": "The corresponding value must be an NSValue containing an NSRect, in screen coordinates, to indicate the starting location of the image on screen. This entry is optional, but if present along with a value for fileAnimationImageKey, and the Dock has an item for the folder containing the relevant file (such as the Downloads folder), the Dock will use them to show an animation of the file flying into the Dock, before invoking acknowledgeWithSuccess:.", "var_name": "fileAnimationImageOriginalRectKey"}, {"var_type": "ProgressUserInfoKey", "var_description": "The corresponding value must be an NSNumber containing an integer to represent the number of completed files. This entry is optional; if you set a value for this key, the auto-generated localizedAdditionalDescription string will make use of it.", "var_name": "fileCompletedCountKey"}, {"var_type": "ProgressUserInfoKey", "var_description": "The corresponding value must be an NSImage, typically an icon to represent the file. This entry is optional, but if it is present, the Finder will use it to show the icon of a file tracked by a progress object.", "var_name": "fileIconKey"}, {"var_type": "ProgressUserInfoKey", "var_description": "A value is required for this key in the user info dictionary when the progress kind is set to file. The corresponding value must be one of the entries listed in File operation kinds.", "var_name": "fileOperationKindKey"}, {"var_type": "ProgressUserInfoKey", "var_description": "The corresponding value must be an NSNumber containing an integer to represent the total number of files affected. This entry is optional; if you set a value for this key, the auto-generated localizedAdditionalDescription string will make use of it.", "var_name": "fileTotalCountKey"}, {"var_type": "ProgressUserInfoKey", "var_description": "", "var_name": "fileURLKey"}], "subclass_list": [], "class_description": "", "class_name": "ProgressUserInfoKey"}