{"class_description": "When you call methods that use random data, such as creating new random values or shuffling a collection, you can pass a RandomNumberGenerator type to be used as the source for randomness. When you don’t pass a generator, the default SystemRandomNumberGenerator type is used.\nWhen providing new APIs that use randomness, provide a version that accepts a generator conforming to the RandomNumberGenerator protocol as well as a version that uses the default system generator. For example, this Weekday enumeration provides static methods that return a random day of the week:\nA custom RandomNumberGenerator type can have different characteristics than the default SystemRandomNumberGenerator type. For example, a seedable generator can be used to generate a repeatable sequence of random values for testing purposes.\nTo make a custom type conform to the RandomNumberGenerator protocol, implement the required next() method. Each call to next() must produce a uniform and independent random value.\nTypes that conform to RandomNumberGenerator should specifically document the thread safety and quality of the generator.\n", "package_name": "swift", "interface_list": [], "Methods": [{"return_value": {"return_name": [""], "return_description": ["An unsigned 64-bit random value."], "return_type": ["UInt64"]}, "class_name": "RandomNumberGenerator", "method_description": "Returns a value from a uniform, independent distribution of binary data.Required. Default implementation provided.", "method_name": "next", "params": []}, {"return_value": {"return_name": [""], "return_description": ["A random value of T in the range 0..<upperBound. Every value in the range 0..<upperBound is equally likely to be returned."], "return_type": ["T"]}, "class_name": "RandomNumberGenerator", "method_description": "Returns a random value that is less than the given upper bound.", "method_name": "next", "params": [{"param_type": "FixedWidthInteger", "param_name": ["upperBound"], "param_description": "The upper bound for the randomly generated value. Must be non-zero."}]}], "class_inherit_list": [], "Vars": [], "subclass_list": [], "class_name": "RandomNumberGenerator"}